Repository: edx/api-integration
Catalog: edx_solutions_api_integration/translations/*/LC_MESSAGES/django.po
Languages: pl

source: group_id is missing
pl: Brak group_id

source: Both start_date and end_date parameters are required
pl: Zarówno parametr start_date jak i end_date są wymagane

source: Interval parameter is not valid. It should be one of these 'days', 'weeks', 'months'
pl: Parametr przedziału czasowego jest niepoprawny. Musi on zostać wyrażony jako jeden z tych ‚dni’, ‚tygodni’, ‚miesięcy’

source: date format is invalid
pl: niepoprawny format danych

source: content_id is missing
pl: Brak content_id

source: user_id is missing
pl: Brak user_id

source: content_id is invalid
pl: Niepoprawny content_id

source: user_id is invalid
pl: Niepoprawny userd_id

source: relationship_type is missing
pl: Brak relationship_type

source: course_id is missing
pl: Brak course_id

source: Empty field: {}
pl: Puste pole: {}

source: Processing Participant
pl: Przetwarzanie uczestnika

source: Status '{}' doesn't exist
pl: Status '{}' nie istnieje

source: Enrolling Participant in Course
pl: Rejestrowanie uczestnika na kurs

source: Email "{}" or username "{}" already exists
pl: Adres e-mail "{}" lub użytkownik "{}" już istnieją

source: Registering Participant
pl: Rejestrowanie uczestnika

source: Company {} doesn't exist
pl: Firma {} nie istnieje!

source: Enrolling Participant in Company
pl: Rejestrowanie uczestnika w firmie

source: User with email "{}" does not exist
pl: Użytkownik o adresie e-mail "{}" nie istnieje

source: Retrieving existing Participant
pl: Pobieranie danych istniejącego użytkownika

source: User with email "{}" is already enrolled
pl: Użytkownik o adresie e-mail "{}" jest już zarejestrowany

source: Course {} doesn't exist
pl: Kurs {} nie istnieje

source: Course {} is not Internal
pl: Kurs {} nie jest kursem wewnętrznym

source: Setting Participant's Status
pl: Ustawienie statusu uczestnika

source: Reason: {}, Activity: {}, Participant: {}
pl: Przyczyna: {}, Aktywność: {}, Uczestnik: {}

source: No email
pl: Brak adresu e-mail

source: username is missing
pl: brak nazwy użytkownika

source: password is missing
pl: brak hasła

source: username or ids are missing
pl: brak nazwy użytkownika lub id

source: Password:
pl: Hasło:

source: Username '{username}' or email '{email}' already exists
pl: Nazwa użytkownika '{username}' lub adres e-mail '{email}' są już zarejestrowane

source: Invalid email address {}.
pl: Nieprawidłowy adres e-mail {}.

source: A user with that email address already exists.
pl: Użytkownik o tym adresie e-mail już istnieje!

source: Could not update profile image
pl: Nie udało się zaktualizować zdjęcia profilowego

source: You are re-using a password that you have used recently. You must have {0} distinct password(s) before reusing a previous password.
pl: Używasz ponownie hasła, którego używałeś niedawno. Musisz ustawić {0} rożne hasło(-a), zanim powrócisz do poprzedniego.

source: You are resetting passwords too frequently. Due to security policies, {0} day(s) must elapse between password resets
pl: Zbyt często resetujesz swoje hasło. Ze względów bezpieczeństwa musi upłynąć {0} dni, zanim będziesz mógł zmienić hasło.

source: Student {student} already added to cohort {cohort_name} for course {course}
pl: Uczeń {student} został już dodany do grupy kursantów {cohort_name} na kursie {course}

source: Student not enrolled in given course
pl: Uczeń nie jest zarejestrowany na tym kursie

source: read field is missing
pl: Brak pola odczytu
